qbpassing_ap/qb_passing_app_api/app/controllers/quarterbacks_controller.rb

  def index
    @quarterbacks = Quarterback.all
---
SELECT "quarterbacks".* FROM "quarterbacks"

    def set_quarterback
      @quarterback = Quarterback.find(params[:id])
---
SELECT "quarterbacks".* FROM "quarterbacks" WHERE "quarterbacks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]