qbpassing_ap/qb_passing_app_api/app/controllers/yards_controller.rb

  def create
    @yard = Yard.new(yard_params)
    @yard.quarterback_id = params[:quarterback_id]

    if @yard.save
---
INSERT INTO "yards" ("highest", "lowest", "created_at", "updated_at", "quarterback_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["highest", 45], ["lowest", 10], ["created_at", "2020-02-01 21:07:06.162151"], ["updated_at", "2020-02-01 21:07:06.162151"], ["quarterback_id", "1"]]